
### Once Asked, we can create this as bkp, create another , and keep on doing that

In [ ]:
# Q1. Handling NULL Values
'''
-- How do you handle NULL values in SQL? 
-- Provide examples of using COALESCE and NULLIF.
     - `COALESCE` returns the first non-NULL value in the list.
     - `NULLIF` returns NULL if the two compared values are equal.

 - SELECT COALESCE(column1, 'default_value') FROM table;
 - SELECT NULLIF(column1, column2) FROM table;
'''

In [ ]:
# Given two tables, how would you find the count of records using INNER JOIN, LEFT JOIN, RIGHT JOIN, and FULL OUTER JOIN?
'''
SELECT 
 count(*) as total_count  
FROM table1 as A  
(INNER JOIN/LEFT JOIN / RIGHT JOIN / FULL JOIN ) AS B
   ON A.key  = B.key 

'''

In [ ]:
#* 3. Write a SQL query to delete the 10th highest salary from the employee table?
'''
DELETE 
FROM (
    SELECT
    *,
    DENSE_RANK() OVER(ORDER BY SALARY DESC) AS RNK
    FROM EMPLOYEE
 )
WHERE RNK = 10

'''

In [ ]:
# 4. How would you find the top 3 highest-paid employees in an organization?
'''
SELECT
* 
FROM 
(
 SELECT 
   *, 
   DENSE_RANK() OVER(ORDER BY SALARY DESC) AS RNK 
) 
WHERE RNK <=3 

'''

In [ ]:
# 6. Write a SQL query to retrieve unique records without using DISTINCT or GROUP BY?
'''
with CTE1 as (
   select 
        name1,
        name2,
        ROW_NUMBER() OVER(PARTITION BY name1, name2 ORDER BY (select null)) as RNK 
  FROM table1 
)
select * FROM CTE1 WHERE RNK = 1
'''

# Explanation
''''
ROW_NUMBER(): Assigns a unique row number for each duplicate combination of column1 and column2 based on the PARTITION BY clause.
CTE: Captures the result of the ROW_NUMBER() operation.
WHERE row_num = 1: Filters out duplicates, leaving only the first occurrence of each unique combination.
Key Points:
The ORDER BY (SELECT NULL) is used to minimize the impact of sorting and can be replaced with a specific column if ordering is required.
Replace ROW_NUMBER() with RANK() or DENSE_RANK() if needed based on your requirements.
'''

In [ ]:
# 7. Write a SQL query to calculate the average salary of employees in each department?

In [ ]:
# 8. Explain how you would handle NULL values in JOIN operations in SQL?

In [ ]:
## 2. Give customer_names of the persons who have not bought 'C'
'''
      -- Customers table:
    -- +-------------+---------------+
    -- | customer_id | customer_name |
    -- +-------------+---------------+
    -- | 1           | Daniel        |
    -- | 2           | Diana         |
    -- | 3           | Elizabeth     |
    -- | 4           | Jhon          |
    -- +-------------+---------------+
    -- Orders table:
    -- +------------+--------------+---------------+
    -- | order_id   | customer_id  | product_name  |
    -- +------------+--------------+---------------+
    -- | 10         |     1        |     A         |
    -- | 20         |     1        |     B         |
    -- | 30         |     1        |     D         |
    -- | 40         |     1        |     C         |
    -- | 50         |     2        |     A         |
    -- | 60         |     3        |     A         |
    -- | 70         |     3        |     B         |
    -- | 80         |     3        |     D         |
    -- | 90         |     4        |     C         |
'''

### SOL 1
'''
  select customer_name from customers NOT IN (select customer_id from Orders where prodcut_name like '%C') # 1, 4
'''

### SOL2: Using Join 
'''
  SELECT 
  FROM CUSTOMER C 
  LEFT JOIN Orders O 
     ON C.customer_id = o.customer_id AND product_name = 'C'
  WHERE product_name is null;

'''